run.simulation_snapshots/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        inGroups        1(empty);
        nFaces          146000;
        startFace       145350;
    }
    cylinderWalls
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       291350;
    }
    bottom
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          450;
        startFace       291750;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          100;
        startFace       292200;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          250;
        startFace       292300;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          100;
        startFace       292550;
    }
)

// ************************************************************************* //
