run.simulation_snapshots/system/controlDict.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

// libs (
//       "libOpenFOAM.so"
//       "libsimpleSwakFunctionObjects.so"
//       "libswakFunctionObjects.so"
//       "libgroovyBC.so"
//      );

//startFrom       startTime;
startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         100; 

deltaT          0.005;
//deltaT          0.01;
//deltaT          0.02;
//deltaT          0.05;

writeControl    adjustableRunTime;
/*
adjustableRunTime
clockTime
cpuTime
runTime
timeStep
*/

writeInterval   50;

/*
secondaryWriteControl    cpuTime;
secondaryWriteInterval   1000; 
secondaryPurgeWrite      1; 
*/

purgeWrite      1;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes; //no;

maxCo           1;
maxDeltaT       0.1;

// ************************************************************************* //

functions
{

forceCoeffs_object
{
    // rhoInf - reference density
    // CofR - Centre of rotation
    // dragDir - Direction of drag coefficient
    // liftDir - Direction of lift coefficient
    // pitchAxis - Pitching moment axis
    // magUinf - free stream velocity magnitude
    // lRef - reference length
    // Aref - reference area
    type                forceCoeffs;
    functionObjectLibs  ("libforces.so");
    //patches             ("body1" "body2" "body3");
    patches             ("cylinderWalls");

    pName       p;
    Uname       U;
    rho         rhoInf;
    rhoInf      1.0;

    //// Dump to file
    log         true;

    CofR        (0 0 0);
    liftDir     (0 1 0);
    dragDir     (1 0 0);
    pitchAxis   (0 0 1);
    magUInf     1.0;
    lRef        1.0;         // reference lenght
    Aref        1.0;         // reference area 1 for 2d

    outputControl   timeStep;
    outputInterval  1;
}

}

// ************************************************************************* //

